FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/СкидкиСтроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СкидкиСтроки</Name>
			<Comment>Сведения о скидках назначаемых на каждую товарную строку документов</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Comment>Значение скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Comment>Действует или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВычисления</Name>
					<Comment>Способ вычисления скидки (относительная/абсолютная)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СкидкиСпособВычисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагВытеснения</Name>
					<Comment>Флаг вытеснения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПрайсЛистаПодарка</Name>
					<Comment>Прайс-лист подарка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрайсЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяСуммаПодарка</Name>
					<Comment>Максимальная сумма на которую можно сделать подарок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения скидки. Если момент больше чем "момент последней загрузки" оборудования, то эту скидку надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Comment>Идентификатор скидки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистраторСкидки</Name>
					<Comment>Ссылка на документ, установивший/отменивший данную скидку</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеСкидокСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РучнаяСкидка</Name>
					<Comment>Истина, если скидка задается в ручную. Ложь, если скидка автоматическая</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Товар или вид товара, на который назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачВремя</Name>
					<Comment>Время начала действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонВремя</Name>
					<Comment>Время окончания действия скидки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>Дни недели, когда действительна скидка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоПодарок</Name>
					<Comment>Истина, если скидка является подарком. Ложь, в противном случае</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Comment>Карта, на которую назначается скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыНакопленияНаКарте</Name>
					<Comment>Сумма накопительная, применяется совместно с дисконтной картой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалОбслуживания</Name>
					<Comment>Зал/Склад/Отдел в котором действует данная скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Свойство документа, от которого зависить скидка</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтСуммыСтроки</Name>
					<Comment>Сумма, начиная с которой скидка имеет действие</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтКоличества</Name>
					<Comment>Количество, начиная с которого предоставляется скидка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило расчета скидки по количеству</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаРасчетаСкидкиПоКоличеству</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Comment>Скидка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаТовары</Name>
					<Comment>Скидка на товары</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаРаботы</Name>
					<Comment>Скидка на работы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/СкидкиСтроки/Ext/RecordSetModule.bsl
// Модуль набора записей регистра "СкидкиСтроки"

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ДокументОбъект			Экспорт;	// Документ объект
Перем РезультатЗапросаПоСкидкам	Экспорт;	// РезультатЗапроса или ТаблицаЗначений.
Перем ПодразделениеКомпании		Экспорт;	// Подразделение компании

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция выполняет отмену проведения
Функция ОтменаПроведения() Экспорт
	// проверим значения ключевых объектов
	Отказ = ((ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.НазначениеСкидокСтроки")) ИЛИ ДокументОбъект.ЭтоНовый());
	
	// приступим к очистки движений
	Если НЕ Отказ Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
		|ГДЕ
		|	СкидкиСтроки.РегистраторСкидки = &РегистраторСкидки";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("РегистраторСкидки", ДокументОбъект.Ссылка);
		
		Запись = РегистрыСведений.СкидкиСтроки.СоздатьМенеджерЗаписи();
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Попытка
				Запись.Прочитать();
				Запись.Удалить();
			Исключение
				Отказ = ИСТИНА;
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Отказ;
КонецФункции

// Функция устанавливает скидки
Функция УстановитьСкидки() Экспорт
	Отказ = ЛОЖЬ;
	
	// проверим значения ключевых объектов
	Если (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.НазначениеСкидокСтроки")) ИЛИ ДокументОбъект.ЭтоНовый() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если (ТипЗнч(ПодразделениеКомпании) <> Тип("СправочникСсылка.ПодразделенияКомпании")) ИЛИ ПодразделениеКомпании.Пустая() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	
	// получаем таблицу товаров
	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
	КонецЕсли;
	
	// если были обнаружены ошибки, то движения делать не будем
	Если НЕ Отказ Тогда
		// Осуществляем запись данных в регистр
		ТабЗаписей = ПолучитьДаныеПоСкидкам(ДокументОбъект.Ссылка);
		НужнаПроверка = ТабЗаписей.Количество() > 0;
		стрОшибок = "";
		
		Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
			// регистр СкидкиСтроки 
			НоваяЗапись = Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
			НоваяЗапись.Период				= ДокументОбъект.ДатаНачалаДействия;
			НоваяЗапись.Подразделение		= ПодразделениеКомпании;
			НоваяЗапись.Действует			= ИСТИНА;
			НоваяЗапись.РегистраторСкидки	= ДокументОбъект.Ссылка;
			НоваяЗапись.Свойство			= ?(обЗначениеНеЗаполнено(НоваяЗапись.Свойство), Неопределено, НоваяЗапись.Свойство);
			НоваяЗапись.ИдентификаторСкидки	= ТекСтрока.ИдентификаторСкидки;
			НоваяЗапись.СкидкаНаТовары		= ТекСтрока.СкидкаНаТовары; 
			НоваяЗапись.СкидкаНаРаботы		= ТекСтрока.СкидкаНаРаботы; 
			НоваяЗапись.МоментИзменения		= ТекущаяДата(); //TruA
			НоваяЗапись.РучнаяСкидка		= ТекСтрока.Скидка.РучнаяСкидка;
			
			Если НужнаПроверка Тогда
				стрПоиск = Новый Структура;
				стрПоиск.Вставить("Подразделение");
				стрПоиск.Вставить("РучнаяСкидка");
				стрПоиск.Вставить("Объект");
				стрПоиск.Вставить("НачВремя");
				стрПоиск.Вставить("КонВремя");
				стрПоиск.Вставить("ДниНедели");
				стрПоиск.Вставить("ЭтоПодарок");
				стрПоиск.Вставить("ДисконтнаяКарта");
				стрПоиск.Вставить("ОтСуммыНакопленияНаКарте");
				стрПоиск.Вставить("ЗалОбслуживания");
				стрПоиск.Вставить("Свойство");
				стрПоиск.Вставить("ОтСуммыСтроки");
				стрПоиск.Вставить("ОтКоличества");
				стрПоиск.Вставить("Правило");
				стрПоиск.Вставить("Скидка");
				стрПоиск.Вставить("СкидкаНаТовары");
				стрПоиск.Вставить("СкидкаНаРаботы");
				
				ЗаполнитьЗначенияСвойств(стрПоиск,НоваяЗапись);
				
				РезПоиска = ТабЗаписей.НайтиСтроки(стрПоиск);
				Если РезПоиска.Количество() > 0 Тогда
					Отказ = Истина;
					дкДобавитьОшибку(стрОшибок, "Для скидки <"+ТекСтрока.Скидка+"> уже есть запись на дату """+ Формат(ДокументОбъект.ДатаНачалаДействия,"ДЛФ=DDT") +""".");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Произведем запись набора (т.к. автоматической записи по окончанию транзакции не будет)
		Если Отказ Тогда
			дкСообщитьРезультат(стрОшибок, "Важное&Скидки (на товарную строку документа):", ДокументОбъект);//ОписаниеОшибки()
		Иначе
			Попытка
				Записать(ЛОЖЬ);
			Исключение
				Отказ = ИСТИНА;
				дкСообщитьРезультат("В процессе записи данных в регистр возникла ошибка.", "Важное&Скидки (на товарную строку документа):", ДокументОбъект);//ОписаниеОшибки()
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// Очистим основные переменные
	ДокументОбъект				= Неопределено;
	РезультатЗапросаПоСкидкам	= Неопределено;
	ПодразделениеКомпании		= Неопределено;
	
	Возврат Отказ;
КонецФункции

// Отменить скидки
Функция ОтменитьСкидки() Экспорт
	Отказ = ЛОЖЬ;
	
	// проверим значения ключевых объектов
	Если (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.НазначениеСкидокСтроки")) ИЛИ ДокументОбъект.ЭтоНовый() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если (ТипЗнч(ПодразделениеКомпании) <> Тип("СправочникСсылка.ПодразделенияКомпании")) ИЛИ ПодразделениеКомпании.Пустая() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	
	// получаем таблицу товаров
	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
	КонецЕсли;
	
	// Осуществляем запись данных в регистр
	Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
		Если НЕ ТекСтрока.СкидкаУстановлена Тогда
			Отказ = ИСТИНА;
			дкСообщитьРезультат("Скидка """+СокрЛП(ТекСтрока.Скидка)+""" ранее не была установлена. Отмена скидки не возможно!", "Важное&Скидки (на товарную строку документа):", ДокументОбъект, ТекСтрока.Скидка);
			Продолжить;
		КонецЕсли;
		
		// регистр СкидкиСтроки
		НоваяЗапись = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
		НоваяЗапись.Период				= ДокументОбъект.ДатаНачалаДействия;
		НоваяЗапись.Подразделение		= ПодразделениеКомпании;
		НоваяЗапись.Действует			= ЛОЖЬ;
		НоваяЗапись.РегистраторСкидки	= ДокументОбъект.Ссылка;
		НоваяЗапись.ИдентификаторСкидки = ТекСтрока.ИдентификаторСкидки; //TruA
		НоваяЗапись.СкидкаНаТовары		= ТекСтрока.СкидкаНаТовары;
		НоваяЗапись.СкидкаНаРаботы		= ТекСтрока.СкидкаНаРаботы;
		НоваяЗапись.МоментИзменения		= ТекущаяДата(); //TruA
	КонецЦикла;
	
	// если были обнаружены ошибки, то движения записывать не будем
	Если НЕ Отказ Тогда
		// Произведем запись набора (т.к. автоматической записи по окончанию транзакции не будет)
		Попытка
			Записать(ЛОЖЬ);
		Исключение
			Отказ = ИСТИНА;
			дкСообщитьРезультат("В процессе записи данных в регистр возникла ошибка.", "Важное&Скидки (на товарную строку документа):", ДокументОбъект);//ОписаниеОшибки()
		КонецПопытки;
	КонецЕсли;
	
	// Очистим основные переменные
	ДокументОбъект				= Неопределено;
	РезультатЗапросаПоСкидкам	= Неопределено;
	ПодразделениеКомпании		= Неопределено;
	
	Возврат Отказ;
КонецФункции

// получение скидок на дуту
Функция ПолучитьДаныеПоСкидкам(ДокСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СкидкиСтроки.Подразделение,
	|	СкидкиСтроки.РучнаяСкидка,
	|	СкидкиСтроки.Объект,
	|	СкидкиСтроки.НачВремя,
	|	СкидкиСтроки.КонВремя,
	|	СкидкиСтроки.ДниНедели,
	|	СкидкиСтроки.ЭтоПодарок,
	|	СкидкиСтроки.ДисконтнаяКарта,
	|	СкидкиСтроки.ОтСуммыНакопленияНаКарте,
	|	СкидкиСтроки.ЗалОбслуживания,
	|	СкидкиСтроки.Свойство,
	|	СкидкиСтроки.ОтСуммыСтроки,
	|	СкидкиСтроки.ОтКоличества,
	|	СкидкиСтроки.Правило,
	|	СкидкиСтроки.Скидка,
	|	СкидкиСтроки.СкидкаНаТовары,
	|	СкидкиСтроки.СкидкаНаРаботы
	|ИЗ
	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	|ГДЕ
	|	СкидкиСтроки.Период = &ДатаНачалаДействия
	|	И СкидкиСтроки.Скидка В
	|			(ВЫБРАТЬ
	|				НазначениеСкидокСтроки.Скидка
	|			ИЗ
	|				Документ.НазначениеСкидокСтроки.Скидки КАК НазначениеСкидокСтроки
	|			ГДЕ
	|				НазначениеСкидокСтроки.Ссылка = &ДокСсылка
	|			СГРУППИРОВАТЬ ПО
	|						НазначениеСкидокСтроки.Скидка)";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ДатаНачалаДействия",ДокСсылка.ДатаНачалаДействия);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
